cristianoag/ESP32_CP400/software/esp32_cp400_emulator/src/CP400Emulator.cpp
/******************************************************************************
 * Project      : esp32_cp400_emulator
 * File         : CP400Emulator.cpp
 * Last Updated : 2026-08-17
 *
 * Description  : CP400 emulator main code (CPU core, video, disk, peripherals)
 *
 * Original work copyright (c) 2026 Cedric Beaudoin
 * CP400 code and modifications copyright (c) 2026 The Retro Hacker
 *
 * Permission is granted for personal, non-commercial use only.
 * Commercial use, distribution, sublicensing, or modification
 * for commercial purposes is strictly prohibited without
 * prior written permission from the author.
 * Please, keep this in the source code.
 * All rights reserved.
 ******************************************************************************/




#include <Arduino.h>
#include "mc6809.hpp"
#include "esp_timer.h"
#include "esp_system.h"

#include "CP400Emulator.h"

#include "ESP32S3vga.h"
#include <GfxWrapper.h>
#include <Fonts/FreeMonoBoldOblique24pt7b.h>
#include <Fonts/FreeSerif24pt7b.h>
#include <Fonts/FreeMono9pt7b.h>



//----------------------------USB STACK-------------------------------------

#include <ESP32-USB-Soft-Host.h>
#include "CP400Input.h"
#define KEY_SHIFT_LEFT




USB_DEVICES_CTRL USB_DEV_CONTROL;



  #define DP_P0  18  // always enabled
  #define DM_P0  17  // always enabled
  #define DP_P1  12
  #define DM_P1  11
  #define DP_P2  16
  #define DM_P2  15
  #define DP_P3  -1
  #define DM_P3  -1

extern USB_DEVICES_CTRL USB_DEV_CONTROL;

extern void Setup_USB(void);





//-----------------------------------------------------------



#define LED_PORT_ANODE 45
#define LED_PORT_CATHODE 46

#define LED_PORT_CATHODE_HI() GPIO.out1_w1ts.val = (1 << (LED_PORT_CATHODE - 32));  // Set HIGH
#define LED_PORT_CATHODE_LOW() GPIO.out1_w1tc.val = (1 << (LED_PORT_CATHODE - 32));  // Set LOW

#define LED_PORT_ANODE_HI() GPIO.out1_w1ts.val = (1 << (LED_PORT_ANODE - 32));  // Set HIGH
#define LED_PORT_ANODE_LOW()  GPIO.out1_w1tc.val = (1 << (LED_PORT_ANODE - 32));  // Set LOW

void inline DISKETTE_LED_ON(void)
{
  LED_PORT_CATHODE_HI();
  LED_PORT_ANODE_LOW();
}
void inline DISKETTE_LED_OFF(void)
{
  LED_PORT_CATHODE_LOW();
  LED_PORT_ANODE_HI();
}
void inline DISKETTE_LED_FLOAT(void)
{
  LED_PORT_CATHODE_LOW();
  LED_PORT_ANODE_LOW();
}




uint8_t uint8_t_VarGlobal;
uint8_t DEBUGloop1, DEBUGloop2;
void Debug1Toggle(void)
{
  if ((DEBUGloop1 & 0b00000001) == 0)
  {
    GPIO.out_w1ts = (1 << DEBUG1);
  }
  else
  {
    GPIO.out_w1tc = (1 << DEBUG1);
  }
  DEBUGloop1++;
}
void Debug2Toggle(void)
{
  if ((DEBUGloop2 & 0b00000001) == 0)
  {
    GPIO.out_w1ts = (1 << DEBUG2);
  }
  else
  {
    GPIO.out_w1tc = (1 << DEBUG2);
  }
  DEBUGloop2++;
}

void Debug2Hi(void)
{
    GPIO.out_w1ts = (1 << DEBUG2);
}

void Debug2Low(void)
{
    GPIO.out_w1tc = (1 << DEBUG2);
}



uint8_t ResetVectors[16] = {0xA6, 0x81, 0x01, 0x00, 0x01, 0x03, 0x01, 0x0F,
	0x01, 0x0C, 0x01, 0x06, 0x01, 0x09, 0xA0, 0x27};




bool CPU_in_WAIT_STATE = false;



File file;
bool SD_Card_Mounted = false;


#ifndef ISR_CORE
char text_buffer[150];
#endif



uint8_t *MENU_Backup = (uint8_t *)heap_caps_malloc(640*250, MALLOC_CAP_SPIRAM);
uint8_t *MENU_BackupPage2 = (uint8_t *)heap_caps_malloc(640*250, MALLOC_CAP_SPIRAM);
#define DISK_SIZE 161280

uint8_t *RAM_Disk0 = (uint8_t *)heap_caps_malloc(161280, MALLOC_CAP_SPIRAM);
uint8_t *RAM_Disk1 = (uint8_t *)heap_caps_malloc(161280, MALLOC_CAP_SPIRAM);
uint8_t *RAM_Disk2 = (uint8_t *)heap_caps_malloc(161280, MALLOC_CAP_SPIRAM);
uint8_t *RAM_Disk3 = (uint8_t *)heap_caps_malloc(161280, MALLOC_CAP_SPIRAM);
#ifdef PSRAM_EMU
uint8_t *rom = (uint8_t *)heap_caps_malloc(32769, MALLOC_CAP_SPIRAM);
uint8_t *memory = (uint8_t *)heap_caps_malloc(65536, MALLOC_CAP_SPIRAM);
#else
uint8_t rom[32769];
uint8_t memory[65536];
#endif



SpecialFunctionStruct sf;

struct DiskAccessStruct
{
  uint8_t TrackPos;
  uint8_t DriveSelected;
  uint8_t MotorOnOff;
  uint8_t SectorPos;
  uint8_t DRIVE_COMMAND;
  uint8_t DataRegisterValue;
  uint32_t DSK_FILE_DataPTR;
  bool IsinReadProcess;
  bool IsInWriteProcess;
  bool NMI_Int_Started;
  uint8_t NMI_Delay;    //To Allow the CP400 to read the last byte from the FD502 before the NMI.
  uint16_t RW_Process_ByteRemainingCounter;
};

DiskAccessStruct DiskAccess;


DriveStruct Disk_Drive;
DiskRomSelection selectedDiskRom = DiskRomSelection::CP400;



  class cpu_t : public mc6809 
{
  public:
      uint8_t read8(uint16_t address) const 
      {
        uint8_t t_data;
        ManagePeripherals_Read(address);
      if (!sf.CP400_32K_UPPER_ENABLED)
      {
        if ((address > 0x7fff))
        {

          return rom[address - ROM_OFFSET];
        }
        else
        {
          return memory[address];
        }

      }
      else
      {
        if ((address > 0xdfff))
        {
          
          return rom[address - ROM_OFFSET];
        }
        else
        {
          return memory[address];
        }
      }

        return 0;
      }

      

      void write8(uint16_t address, uint8_t value) const 
      {
          ManagePeripherals_Write(address , value);


        if (!sf.CP400_32K_UPPER_ENABLED)
        {
          if (address >0x7fff)
          {
              
              //rom[address - 0x8000] = value;
          
          } 
          else
          {
              memory[address] = value;
          }
        }
        else
        {
              memory[address] = value;
        }



          
        }


};



bool ReadCP400DiskImage(const char* filename, uint8_t DriveNumber)
{
    if (!SD_Card_Mounted)
    {
      return false;
    }
    
    
    size_t bytesRead;
    File f = SD_MMC.open(filename, FILE_READ);
    if(!f)
    {
#ifdef DEBUG_PRINT    
        Serial.print("Failed to open file: ");
        Serial.println(filename);
#endif
        return false;
    }

    
    switch (DriveNumber)
    {
    case 0:
      bytesRead = f.read(RAM_Disk0, DISK_SIZE);
    break;
    case 1:
      bytesRead = f.read(RAM_Disk1, DISK_SIZE);
    break;
    case 2:
      bytesRead = f.read(RAM_Disk2, DISK_SIZE);
    break;
    case 3:
      bytesRead = f.read(RAM_Disk3, DISK_SIZE);
    break;
    
    default:
      break;
    }
    
    

