cristianoag/ESP32_CP400/software/esp32_cp400_emulator/src/CP400Emulator.cpp
#ifdef DEBUG_PRINT    
    Serial.print("Read ");
    Serial.print(bytesRead);
    Serial.print(" bytes into RAM_Disk ");
    Serial.println(DriveNumber);
#endif
    f.close();
    

    return true;
}

bool SaveConfigToSD(void) 
{
    if (!SD_Card_Mounted)
    {
      return false;
    }

    if (SD_MMC.exists("/config.ccc") && !SD_MMC.remove("/config.ccc"))
    {
      Serial.println("Failed to replace /config.ccc");
      return false;
    }

    File f = SD_MMC.open("/config.ccc", FILE_WRITE);
    if (!f) {
        Serial.println("Failed to open /config.ccc for writing");
        return false;
    }

    for (int i = 0; i < 4; i++) 
    {
        size_t written = f.write(Disk_Drive.Name_Disk[i], 256);
        if (written != 256) 
        {
            Serial.printf("Write failed for disk %d\n", i);
            f.close();
            return false;
        }
    }

    const uint8_t diskRomValue = static_cast<uint8_t>(selectedDiskRom);
    if (f.write(&diskRomValue, sizeof(diskRomValue)) != sizeof(diskRomValue))
    {
        Serial.println("Failed to save Disk ROM selection");
        f.close();
        return false;
    }

    const uint8_t calibrationHeader[] = {'J', 'C', 'A', 'L', 4};
    if (f.write(calibrationHeader, sizeof(calibrationHeader)) != sizeof(calibrationHeader) ||
      f.write(reinterpret_cast<const uint8_t*>(USB_DEV_CONTROL.JOYSTICK_CALIBRATION),
          sizeof(USB_DEV_CONTROL.JOYSTICK_CALIBRATION)) != sizeof(USB_DEV_CONTROL.JOYSTICK_CALIBRATION))
    {
      Serial.println("Failed to save joystick calibration");
      f.close();
      return false;
    }

    f.close();
    Serial.println("Configuration saved to SD");
    return true;
}

bool LoadConfigFromSD(void)
{
  memset(USB_DEV_CONTROL.JOYSTICK_CALIBRATION, 0,
       sizeof(USB_DEV_CONTROL.JOYSTICK_CALIBRATION));

    if (!SD_Card_Mounted)
    {
      return false;
    }

    File f = SD_MMC.open("/config.ccc", FILE_READ);
    if (!f) 
    {
        Serial.println("Failed to open /config.ccc for reading");
        return false;
    }

    for (int i = 0; i < 4; i++) 
    {
        size_t readBytes = f.read(Disk_Drive.Name_Disk[i], 256);
        if (readBytes != 256) 
        {
            Serial.printf("Read failed for disk %d\n", i);
            f.close();
            return false;
        }
    }

    uint8_t diskRomValue = static_cast<uint8_t>(DiskRomSelection::CP400);
    const size_t selectionBytes = f.read(&diskRomValue, sizeof(diskRomValue));
    if (selectionBytes == 0)
    {
        Serial.println("Legacy configuration found; using CP400 Disk ROM");
        selectedDiskRom = DiskRomSelection::CP400;
    }
    else if (diskRomValue <= static_cast<uint8_t>(DiskRomSelection::CoCo2))
    {
        selectedDiskRom = static_cast<DiskRomSelection>(diskRomValue);
    }
    else
    {
        Serial.println("Invalid Disk ROM selection; using CP400 Disk ROM");
        selectedDiskRom = DiskRomSelection::CP400;
    }

    uint8_t calibrationHeader[5];
    JoystickCalibration calibration[2];
    if (f.read(calibrationHeader, sizeof(calibrationHeader)) == sizeof(calibrationHeader) &&
      memcmp(calibrationHeader, "JCAL\x04", sizeof(calibrationHeader)) == 0 &&
      f.read(reinterpret_cast<uint8_t*>(calibration), sizeof(calibration)) == sizeof(calibration))
    {
      for (uint8_t joystick = 0; joystick < 2; joystick++)
      {
        if (calibration[joystick].valid && calibration[joystick].reportLength > 0 &&
            calibration[joystick].reportLength <= JOYSTICK_REPORT_SIZE)
        {
          USB_DEV_CONTROL.JOYSTICK_CALIBRATION[joystick] = calibration[joystick];
        }
      }
    }

    f.close();
    Serial.println("Configuration loaded from SD");
    return true;
}


bool WriteCP400DiskImage(const char* filename, uint8_t DriveNumber)
{
  //return true;
  if (!SD_Card_Mounted)
  {
    return false;
  }

  size_t bytesWritten = 0;
    
    
    File f = SD_MMC.open(filename, FILE_WRITE);
    if(!f)
    {
#ifdef DEBUG_PRINT    
      Serial.print("Failed to open file for writing: ");
      Serial.println(filename);
#endif
      return false;
    }

    switch(DriveNumber)
    {
        case 0:
            bytesWritten = f.write(RAM_Disk0, DISK_SIZE);
        break;

        case 1:
            bytesWritten = f.write(RAM_Disk1, DISK_SIZE);
        break;

        case 2:
            bytesWritten = f.write(RAM_Disk2, DISK_SIZE);
        break;

        case 3:
        bytesWritten = f.write(RAM_Disk3, DISK_SIZE);
        break;

        default:
#ifdef DEBUG_PRINT    
        Serial.println("Invalid DriveNumber");
#endif
        f.close();
        return false;
    }

    f.flush();     // force physical write
    f.close();

#ifdef DEBUG_PRINT    
    Serial.print("Written ");
    Serial.print(bytesWritten);
    Serial.print(" bytes from RAM_Disk ");
    Serial.println(DriveNumber);
#endif
    return (bytesWritten == DISK_SIZE);
}




cpu_t cpu;

void DoCPU(void)
{
  //Debug1Toggle();
  
  if (CPU_in_WAIT_STATE)
  {
    if (sf.CPU_HALTED_BY_EMULATOR) //If Emulator is in Menus, 
    {
      return;
    }
    
    if (gpio_get_level(VSYNC_PORT) != 0)  //Manage CWAI instruction
    {
      return;
    }
    else
    {
      CPU_in_WAIT_STATE = false;
    }
  }
  //Debug1Toggle();
  
  cpu.execute();
  cpu.execute();
  if (sf.CPU_Speed == CPU_FAST)
  {
    cpu.execute();
    cpu.execute();
  }

  return;
}

void CopyDiskToRamDisk(void)
{
  if (!SD_Card_Mounted)
  {
    return;
  }

  ReadCP400DiskImage((const char*)Disk_Drive.Name_Disk[0], 0);
  ReadCP400DiskImage((const char*)Disk_Drive.Name_Disk[1], 1);
  ReadCP400DiskImage((const char*)Disk_Drive.Name_Disk[2], 2);
  ReadCP400DiskImage((const char*)Disk_Drive.Name_Disk[3], 3);
  
}



  const PinConfig pins(-1,-1,-1,5,4,  -1,-1,-1,-1,7,6,  -1,-1,-1,9,8,  2,1);
//                             B B X       G  G  X         R  R
    //6 bit mode for Coco 3    0 1 X       0  1  X         0  1

VGA* vga;
GfxWrapper<VGA> *gfx;


Mode mode0 = Mode::MODE_320x240x60;
Mode mode1 = Mode::MODE_320x240x60_4_3;
Mode mode2 = Mode::MODE_640x240x60;
Mode mode3 = Mode::MODE_640x240x60_4_3;

#ifndef VIDEO_Y_OFFSET
#define VIDEO_Y_OFFSET 24
#endif

