cristianoag/ESP32_CP400/software/esp32_cp400_emulator/src/CP400Emulator.cpp
#ifndef VIDEO_GRAPHICS_X_OFFSET
#define VIDEO_GRAPHICS_X_OFFSET 32
#endif

#if VIDEO_Y_OFFSET < 0 || VIDEO_Y_OFFSET > 48
#error "VIDEO_Y_OFFSET must be between 0 and 48"
#endif

#if VIDEO_GRAPHICS_X_OFFSET < 0 || VIDEO_GRAPHICS_X_OFFSET > 70
#error "VIDEO_GRAPHICS_X_OFFSET must be between 0 and 70"
#endif

constexpr uint16_t VIDEO_ACTIVE_HEIGHT = 192;



uint8_t SCAN_Keyboard_Matrix[8][7];


uint8_t ReadCP400Buttons(void)
{
  uint8_t val1, val2;
  val1 = USB_DEV_CONTROL.JOY1_BUTT1 & USB_DEV_CONTROL.JOY1_BUTT2;
  val2 = (USB_DEV_CONTROL.JOY2_BUTT1 & USB_DEV_CONTROL.JOY2_BUTT2) << 1;

  return val1 | val2;
  
}

void InitSD_Card1(void)
{
  SD_MMC.setPins(SD_MMC_CLK, SD_MMC_CMD, SD_MMC_D0);
  if (!SD_MMC.begin("/sdcard", true, false, SDMMC_FREQ_DEFAULT, 5)) 
  {
    Serial.println("Card Mount Failed");
    return;
  }

 file = SD_MMC.open("/GAMES01.DSK", FILE_READ);
  if (!file)
  {
    Serial.println("Failed to open /GAMES01.DSK");
    return;
  }
  else
  {
    Serial.println("File Correct");
  }
  while(1)
  {

  }
}
extern void flashFromSD(const char* filename);
void CheckFirmwareUpdate(void)
{
  if (!SD_Card_Mounted)
  {
    return;
  }

  debugln("Before flash");
  flashFromSD("/qprcx.rty");  //Random name for flash file (Created from the Flash menu).  Will be ereased after flash.
}


void InitSD_Card(void)
{

  SD_MMC.setPins(SD_MMC_CLK, SD_MMC_CMD, SD_MMC_D0);
  
  if (!SD_MMC.begin("/sdcard", true, false, SDMMC_FREQ_DEFAULT, 5)) {
    SD_Card_Mounted = false;
    debugln("Card Mount Failed");
    return;
  }
  uint8_t cardType = SD_MMC.cardType();
  if(cardType == CARD_NONE){
    SD_Card_Mounted = false;
    debugln("No SD_MMC card attached");
    return;
  }

  SD_Card_Mounted = true;

  Serial.print("SD_MMC Card Type: ");
  if(cardType == CARD_MMC){
    debugln("MMC");
  } else if(cardType == CARD_SD){
    debugln("SDSC");
  } else if(cardType == CARD_SDHC){
    debugln("SDHC");
  } else {
    debugln("UNKNOWN");
  }

}

#define BOARD_CASSETTE_OUT 13
#define BOARD_CASSETTE_IN 14
#define BOARD_CASSETTE_RELAY 10

#define ROM_OFFSET 0x8000
#define RAM_MODE 0x0000
void InitPeripherals_and_Others(void)
{
  

  for(uint32_t i = 0; i !=65536; i++)
  {
      memory[i] = 255;
  }
  
  Serial.begin(115200);
  delay(10);
  
  InitSD_Card();
  
  CheckFirmwareUpdate();
  
  
  InitDisks();

  cpu.assign_nmi_line(&sf.nmi_pin);
  cpu.assign_firq_line(&sf.firq_pin);
  cpu.assign_irq_line(&sf.irq_pin);

  
  //------Special registers------
  sf.CPU_HALTED_BY_EMULATOR = false;
  sf.DIRECT_Key_Code = 0;  //Nothing
  sf.PHYSICAL_Drive_Must_Be_Saved = false;
  sf.V_Synch_Int_Enabled = false;
  sf.nmi_pin = true;  //True = disabled
  sf.firq_pin = true; //True = disabled
  sf.irq_pin = true; //True = disabled
  sf.V_Synch = false;
  sf.CP400_32K_UPPER_ENABLED = false;
  sf.ROM_Offset = ROM_OFFSET;
  sf.AnyKeypress = false; //Used for Keyboard Scan.
  
  sf.CPU_Speed = CPU_SLOW;
  sf.CP400VideoGenMODE = 255;    //To reset in first execution
  sf.CP400VideoPageOffset_Registers = 0b00000010; //Init to be at address 400 (Even if Basic set it at boot)
  sf.CP400ColorMode = 0;
  sf.VideoEmulatorXpixels = 320;
  sf.Artefact = true; //Artefact mode by default.
  sf.CP400GraphicMode = 0;

  sf.is_JOY1_B1_WasPressed = false;
  sf.is_JOY1_B2_WasPressed = false;
  sf.is_JOY2_B1_WasPressed = false;
  sf.is_JOY2_B2_WasPressed = false;
  sf.is_LastKeyboardScanned = false;
  sf.JoystickDebug = true;
//------------Init of Disk Registers------

  DiskAccess.IsinReadProcess = false;
  DiskAccess.IsInWriteProcess = false;
  DiskAccess.NMI_Int_Started = false;
  DiskAccess.NMI_Delay = 0;

  InitPorts();

  
  
  CopyCP400ROMS();
  //CopyCoCo3ROMS();
	
  CopyDiskToRamDisk();
  
  vga = new VGA();
  gfx = new GfxWrapper<VGA>(*vga, mode1.hRes, mode1.vRes);
  vga->bufferCount = 2;
	if(!vga->init(pins, mode1, 8)) while(1) delay(1);
	vga->start();

  SetVideoMode(VIDEO_MODE_320X240_4_3);
  for (int y = 0; y < mode1.vRes; y++)
  {
    for (int x = 0; x < mode1.hRes; x++)
    {
      if (x < mode1.hRes / 4)
      {
        vga->dot(x, y, vga->rgb(255, 255, 255));
      }
      else if (x < mode1.hRes / 2)
      {
        vga->dot(x, y, vga->rgb(255, 0, 0));
      }
      else if (x < (mode1.hRes * 3) / 4)
      {
        vga->dot(x, y, vga->rgb(0, 255, 0));
      }
      else
      {
        vga->dot(x, y, vga->rgb(0, 0, 255));
      }
    }
  }
  vga->show();
  //SetVideoMode(MODE_320x240x60_4_3);
  //SetVideoMode(VIDEO_MODE_320X240_16_9);
  //SetVideoMode(VIDEO_MODE_640X240_16_9);
  //SetVideoMode(VIDEO_MODE_640X240_4_3);

}

void InitPorts(void)
{
  ledcSetup (0, 40000, 8);  // PWM Sound Configuration
  ledcAttachPin(47, 0);                   //
  ledcWrite(0,127);


  //analogReadResolution(8);
  //int initval = analogRead(BOARD_CASSETTE_IN);
  //adc1_config_channel_atten(ADC1_CHANNEL_6, ADC_ATTEN_DB_0); // 0-1.1V
  
  //pinMode(BOARD_CASSETTE_OUT,OUTPUT);
  //pinMode(BOARD_CASSETTE_RELAY, OUTPUT);
  //digitalWrite(BOARD_CASSETTE_RELAY, LOW);  //Disable Relay.

  return;
}
void SetVideoMode(uint8_t VideoMode)
{
  vga->stop();
  switch (VideoMode)
  {
  case VIDEO_MODE_320X240_16_9:
    sf.VideoEmulatorXpixels = 320;
    if(!vga->Reinit(pins, mode0, 8)) while(1) delay(1);
    break;
    case VIDEO_MODE_320X240_4_3:
      sf.VideoEmulatorXpixels = mode1.hRes;
      if(!vga->Reinit(pins, mode1, 8)) while(1) delay(1);
    break;
    case VIDEO_MODE_640X240_16_9:
      sf.VideoEmulatorXpixels = 640;  
      if(!vga->Reinit(pins, mode2, 8)) while(1) delay(1);
    break;
    case VIDEO_MODE_640X240_4_3:
      sf.VideoEmulatorXpixels = 640;  
      if(!vga->Reinit(pins, mode3, 8)) while(1) delay(1);
    break;
  
  default:
    break;
  }
  vga->start();

}



const int Field_Synch_Interrupt_PIN = VSYNC_PORT;  // VSynch pin


void IRAM_ATTR Field_Synch_Interrupt_Flag() 
{
  /*
    This interrupt is tied to the Vertical Pin of the ESP32
    and is used to update the Field interrupt flag of FF03 bit 7.
    A read of FF02 reset this flag (1 = reset 0 = set)
  
    */

  rom[ROM_FF03] |= 0b10000000;  //Set bit 7

