cristianoag/ESP32_CP400/software/esp32_cp400_emulator/src/CP400Emulator.cpp
  if (sf.V_Synch_Int_Enabled)
  {
    sf.irq_pin = false;  //Interrupt enabled.
  }
  sf.V_Synch = true;
  //Debug2Toggle();

}


/*

---------------------------------
FF22:
Resolution Selection
F8 = Pmode 4 256x192 2 colors 11111XXX
E8 = Pmode 3 128x192 4 colors 11101XXX
D8 = pmode 2 128x192 2 colors 11011XXX
C8 = pmode 1 128x96  4 colors 11001XXX
B8 = pmode 0 128x96  2 colors 10111XXX

--SAM CONTROL REGISTERS:




76543210
||||||||_RS232 DATA INPUT
|||||||__SINGLE BIT SOUND OUTPUT
||||||___RAM SIZE INPUT
|||||____VDG CSS -Color set (0 = white, 1 = green)
||||_____VDG GM0
|||______VDG GM1
||_______VDG GM2
|________VDG _A/G

SCREEN X,X 
       | |_____COLOR SET     0 = COLOR SET 1  1 = COLOR SET 2
       |_______DISPLAY MODE  0 = TEXT 1 = GRAPHIC


Mode VDG Settings SAM
                      A/G GM2 GM1 GM0 V2/V1/V0    Desc.   RAM used x,y,clrs in hex(dec)
Internal alphanumeric  0   X   X   0   0  0  0    32x16 ( 5x7 pixel ch)
External alphanumeric  0   X   X   1   0  0  0    32x16 (8x12 pixel ch)
Semigraphic-4          0   X   X   0   0  0  0    32x16 ch, 64x32 pixels
Semigraphic-6          0   X   X   1   0  0  0    64x48 pixels
Full graphic 1-C       1   0   0   0   0  0  1    64x64x4 $400(1024)
Full graphic 1-R       1   0   0   1   0  0  1   128x64x2 $400(1024)
Full graphic 2-C       1   0   1   0   0  1  0   128x64x4 $800(2048)
Full graphic 2-R       1   0   1   1   0  1  1   128x96x2 $600(1536)
Full graphic 3-C       1   1   0   0   1  0  0   128x96x4 $C00(3072)
Full graphic 3-R       1   1   0   1   1  0  1   128x192x2 $C00(3072)
Full graphic 6-C       1   1   1   0   1  1  0   128x192x4 $1800(6144)
Full graphic 6-R       1   1   1   1   1  1  0   256x192x2 $1800(6144)
Direct memory access   X   X   X   X   1  1  1

- The graphic modes with -C are 4 color, -R is 2 color.
- 2 color mode - 8 pixels per byte (each bit denotes on/off)
4 color mode - 4 pixels per byte (each 2 bits denotes color)
- CSS (in FF22) is the color select bit:
Color set 0: 0 = black, 1 = green for -R modes
00 = green, 01 = yellow for -C modes
10 = blue, 11 = red for -C modes
Color set 1: 0 = black, 1 = buff for -R modes


*/

bool IsButtonPressed(void)
{
  if (digitalRead(21) == true)
  {
    return false;
  }
  else
  {
    return true;
  }
}
uint8_t debugloop = 0;

hw_timer_t* cpuTimer = NULL;
portMUX_TYPE timerMux = portMUX_INITIALIZER_UNLOCKED;

uint32_t testloop1 = 0;

void IRAM_ATTR onCPUTimer() 
{
  
  Debug1Toggle();
  cpu.execute(); 
  cpu.execute(); 
  testloop1++;
  if (testloop1 == 20000)
  {
    testloop1 = 0;
  }
  
  
}

void setTimerInterval(uint32_t newInterval) //To set Slow/Fast CPU speed
{
  // Disable actual alarm
  timerAlarmDisable(cpuTimer);
  
  // Change timer interval
  timerAlarmWrite(cpuTimer, newInterval, true);  // newInterval est le nombre de ticks
  
  // Réactiver l'alarme
  timerAlarmEnable(cpuTimer);
}

static bool JoystickByteMatches(uint8_t currentValue, uint8_t neutralValue,
                                uint8_t controlValue, uint8_t compareBits)
{
  const int delta = static_cast<int>(controlValue) - static_cast<int>(neutralValue);

  //A large move is an analog axis, so accept anything past the halfway point.
  if (delta >= 32 || delta <= -32)
  {
    const int threshold = static_cast<int>(neutralValue) + delta / 2;
    return delta > 0 ? static_cast<int>(currentValue) >= threshold
                     : static_cast<int>(currentValue) <= threshold;
  }

  //An empty mask would match every value, so compare the whole byte instead.
  if (compareBits == 0)
  {
    return currentValue == controlValue;
  }

  return ((currentValue ^ controlValue) & compareBits) == 0;
}

bool IsJoystickControlActive(uint8_t joystick, JoystickControl control)
{
  const JoystickCalibration &calibration = USB_DEV_CONTROL.JOYSTICK_CALIBRATION[joystick];
  if (!calibration.valid ||
      USB_DEV_CONTROL.JOYSTICK_REPORT_LENGTH[joystick] != calibration.reportLength)
  {
    return false;
  }

  const uint8_t *current = USB_DEV_CONTROL.JOYSTICK_REPORT[joystick];
  const bool isDirection = control <= JOYSTICK_RIGHT;
  bool checkedAnyByte = false;

  for (uint8_t index = 0; index < calibration.reportLength; index++)
  {
    const uint8_t changedBits = calibration.controlBits[control][index];
    if (!calibration.stable[index] || changedBits == 0)
    {
      continue;
    }

    //Directions share one mask so a hat value cannot also match its neighbours.
    const uint8_t compareBits = isDirection ? calibration.directionBits[index] : changedBits;
    if (!JoystickByteMatches(current[index], calibration.neutral[index],
                             calibration.control[control][index], compareBits))
    {
      return false;
    }
    checkedAnyByte = true;
  }

  return checkedAnyByte;
}

void PrintJoystickCalibration(uint8_t joystick)
{
  const JoystickCalibration &calibration = USB_DEV_CONTROL.JOYSTICK_CALIBRATION[joystick];
  if (!calibration.valid)
  {
    printf("JOY%u calibration: none\n", joystick + 1);
    return;
  }

  static const char *controlNames[JOYSTICK_CONTROL_COUNT] =
  {
    "UP", "DOWN", "LEFT", "RIGHT", "BTN1", "BTN2"
  };

  printf("JOY%u calibration len=%u\n", joystick + 1, calibration.reportLength);
  printf("  neutral :");
  for (uint8_t index = 0; index < calibration.reportLength; index++)
  {
    printf(" %02X", calibration.neutral[index]);
  }
  printf("\n  stable  :");
  for (uint8_t index = 0; index < calibration.reportLength; index++)
  {
    printf(" %02X", calibration.stable[index]);
  }
  printf("\n");

  for (uint8_t control = 0; control < JOYSTICK_CONTROL_COUNT; control++)
  {
    printf("  %-5s v:", controlNames[control]);
    for (uint8_t index = 0; index < calibration.reportLength; index++)
    {
      printf(" %02X", calibration.control[control][index]);
    }
    printf("  b:");
    for (uint8_t index = 0; index < calibration.reportLength; index++)
    {
      printf(" %02X", calibration.controlBits[control][index]);
    }
    printf("\n");
  }

  printf("  dirbits :");
  for (uint8_t index = 0; index < calibration.reportLength; index++)
  {
    printf(" %02X", calibration.directionBits[index]);
  }
  printf("\n");
}

