cristianoag/ESP32_CP400/software/esp32_cp400_emulator/src/CP400Emulator.cpp
uint8_t ReadJoysticks(uint8_t JoyNum)
{
  switch (JoyNum)
  {
  case JOY2_X_SELECT:
    return USB_DEV_CONTROL.JOY2_X_AXIS;
  case JOY1_X_SELECT:
    return USB_DEV_CONTROL.JOY1_X_AXIS;
  case JOY2_Y_SELECT:
    return USB_DEV_CONTROL.JOY2_Y_AXIS;
  case JOY1_Y_SELECT:
    return USB_DEV_CONTROL.JOY1_Y_AXIS;
  default:
    return 255;
  }
}


void PrintJoystickState(uint8_t joystick);

//Runs on the free core so the video task cannot starve it and Serial cannot stall USB.
void JoystickDebugCore(void *pvParameters)
{
  static uint8_t lastReport[2][JOYSTICK_REPORT_SIZE];
  static uint8_t lastLength[2] = {255, 255};

  while (true)
  {
    if (sf.JoystickDebug)
    {
      for (uint8_t joystick = 0; joystick < 2; joystick++)
      {
        const uint8_t reportLength = USB_DEV_CONTROL.JOYSTICK_REPORT_LENGTH[joystick];
        if (reportLength == 0)
        {
          continue;
        }

        if (reportLength == lastLength[joystick] &&
            memcmp(lastReport[joystick], USB_DEV_CONTROL.JOYSTICK_REPORT[joystick],
                   reportLength) == 0)
        {
          continue;
        }

        memcpy(lastReport[joystick], USB_DEV_CONTROL.JOYSTICK_REPORT[joystick],
               JOYSTICK_REPORT_SIZE);
        lastLength[joystick] = reportLength;
        PrintJoystickState(joystick);
      }
    }

    vTaskDelay(10);
  }
}

//initial setup


void setup()
{
  
  
  pinMode(DEBUG1,OUTPUT);
  pinMode(DEBUG2,OUTPUT);
  pinMode(LED_PORT_ANODE,OUTPUT);
  pinMode(LED_PORT_CATHODE,OUTPUT);




  InitPeripherals_and_Others();

  DISKETTE_LED_OFF();

#define SERIAL1_TX 41
#define SERIAL1_RX 42
#define SERIAL1_BAUD 115200

  Serial1.begin(SERIAL1_BAUD, SERIAL_8N1, SERIAL1_RX, SERIAL1_TX);



  cpu.reset();

  Setup_USB();

  PrintJoystickCalibration(0);
  PrintJoystickCalibration(1);


  xTaskCreatePinnedToCore
  (
    VideoCore,        // Fonction
    "SystemCore",      // Name
    6048,              // stack
    NULL,              // Parameter
    2,                 // Priority
    NULL,              // Handle 
    1                  // CPU 0 or 1
  );

  xTaskCreatePinnedToCore(JoystickDebugCore, "JoyDebug", 4096, NULL, 1, NULL, 0);

}


void loop()
{
  //Nothig to do here, all the work is in ISR and RTOS
}


#define CP400_GRAPH_MODE_32X16_8X12 0b0 //Text 32x16
#define CP400_GRAPH_MODE_256X192X2 0b11110110  //PMODE 4
#define CP400_GRAPH_MODE_128X192X4 0b11100110  //PMODE 3  OK


#define CP400_GRAPH_MODE_128X192X2 0b11010101  //PMODE 2
#define CP400_GRAPH_MODE_128X96X4 0b11000100  //PMODE 1
#define CP400_GRAPH_MODE_128X96X4_1 0b11110100  //PMODE 1 Other mode??


#define CP400_GRAPH_MODE_128X96X2 0b10110011  //PMODE 0


//---------Other modes in assembly language only, not officialy supported in Basic CP400
#define CP400_GRAPH_MODE_128X64X4 0b10100010  //
#define CP400_GRAPH_MODE_128X64X2 0b10010001  //

#define CP400_GRAPH_MODE_64X64X4 0b10000001  //


#ifdef DEBUG_ALL
#define WAIT_VSYNCH_LOW()  while(gpio_get_level(VSYNC_PORT) != 0) {DEBUG1_SET;}DEBUG1_CLR
#else
#define WAIT_VSYNCH_LOW()  while(gpio_get_level(VSYNC_PORT) != 0) {}
#endif
#define X_OFFSET_32 312
void IRAM_ATTR VideoCore(void *pvParameters) 
{
  uint8_t ModeValue;
  while (true) 
  {
    //vTaskDelay(1);
    if (sf.DIRECT_Key_Code == MENU_F12) //Emulator menu entrance
    {
      
      CPU_in_WAIT_STATE = true;
      sf.CPU_HALTED_BY_EMULATOR = true;
      vTaskDelay(1);

      EMULATOR_Menu();
      CPU_in_WAIT_STATE = false;
      sf.CPU_HALTED_BY_EMULATOR = false;
      vTaskDelay(200);
    }
    



    ModeValue = sf.CP400GraphicMode & 0b11110111;    //Remove the Color bit
    
    switch (ModeValue)
    {
    
      case CP400_GRAPH_MODE_32X16_8X12:
        RenderCP400GraphMode_32X16_8X12();
      break;

      case CP400_GRAPH_MODE_256X192X2:
        if (sf.Artefact)
        {
          RenderCP400GraphMode_256X192X2_Artefact();
        }
        else
        {
          RenderCP400GraphMode_256X192X2();
        }
      break;

      case CP400_GRAPH_MODE_128X192X4:
        RenderCP400GraphMode_128X192X4();
      break;

      case CP400_GRAPH_MODE_128X192X2:
        RenderCP400GraphMode_128X192X2();
      break;

      case CP400_GRAPH_MODE_128X96X4:
      case CP400_GRAPH_MODE_128X96X4_1:
      RenderCP400GraphMode_128X96X4();
      break;

      case CP400_GRAPH_MODE_128X96X2:
        RenderCP400GraphMode_128X96X2();
      break;

      case CP400_GRAPH_MODE_128X64X4:
        RenderCP400GraphMode_128X64X4();
      break;

      case CP400_GRAPH_MODE_128X64X2:
        RenderCP400GraphMode_128X64X2();
    break;

    case CP400_GRAPH_MODE_64X64X4:
      RenderCP400GraphMode_64X64X4();
break;

      
      
      default:
      break;
    }

    
    
    /*
    while (!sf.V_Synch) //While no interrupt
    {
      //vTaskDelay(1);
      NOP();
    }*/


    WAIT_VSYNCH_LOW();
    Field_Synch_Interrupt_Flag();
  
    vga->show();
    
    if (sf.PHYSICAL_Drive_Must_Be_Saved)
    {
      DISKETTE_LED_ON();
      WriteCP400DiskImage((const char*)Disk_Drive.Name_Disk[DiskAccess.DriveSelected],DiskAccess.DriveSelected);
      DISKETTE_LED_OFF();
      sf.PHYSICAL_Drive_Must_Be_Saved = false;
    }

    FillKeyboardMatrix();
  }
}


void RenderCP400GraphMode_64X64X4(void)
{


  if (sf.CP400VideoGenMODE != CP400_GRAPH_MODE_64X64X4)
  {
    vga->clear(0b11111111);
    vga->show();
    vga->clear(0b11111111);
    vga->show();

    sf.CP400VideoGenMODE = CP400_GRAPH_MODE_64X64X4;
  }




  
  uint32_t MemLoop = sf.CP400VideoPageOffset_Registers * CP400_GRAPH_OFFSET_LEN;
  uint16_t Xloop, Yloop, Yloop1;
  uint8_t Dot1bit[8];
  uint8_t Color[4];
  
  if ((sf.CP400GraphicMode & 0b00001000) == 0)
  {
    Color[0] = RGB332ToVGAPacked(0b00011100);  //Green
    Color[1] = RGB332ToVGAPacked(0b11111100);  //Yellow
    Color[2] = RGB332ToVGAPacked(0b00000011);  //Blue
    Color[3] = RGB332ToVGAPacked(0b11100000);  //Red
  }
  else
  {
    Color[0] = RGB332ToVGAPacked(0xff); //blanc
    Color[1] = RGB332ToVGAPacked(0b01011011);  //Turquoise
    Color[2] = RGB332ToVGAPacked(0b11100011);  //lilas
    Color[3] = RGB332ToVGAPacked(0b11101000);  //orange(buff)
  }  

  for (Yloop = VIDEO_Y_OFFSET; Yloop < VIDEO_Y_OFFSET + VIDEO_ACTIVE_HEIGHT; Yloop+=3)
  {
        for (Xloop = VIDEO_GRAPHICS_X_OFFSET; Xloop < VIDEO_GRAPHICS_X_OFFSET + 256; Xloop+=16)
    {

      Dot1bit[3] = (memory[MemLoop] >> 6) & 0b11;  // Bits 6-7
      Dot1bit[2] = (memory[MemLoop] >> 4) & 0b11;  // Bits 4-5
      Dot1bit[1] = (memory[MemLoop] >> 2) & 0b11;  // Bits 2-3
      Dot1bit[0] = (memory[MemLoop++] >> 0) & 0b11;  // Bits 0-1

      //Line one
      vga->dot(Xloop,Yloop, Color[Dot1bit[3]]);
      vga->dot(Xloop+1,Yloop, Color[Dot1bit[3]]);
      vga->dot(Xloop+2,Yloop, Color[Dot1bit[3]]);
      vga->dot(Xloop+3,Yloop, Color[Dot1bit[3]]);

      vga->dot(Xloop+4,Yloop, Color[Dot1bit[2]]);
      vga->dot(Xloop+5,Yloop, Color[Dot1bit[2]]);
      vga->dot(Xloop+6,Yloop, Color[Dot1bit[2]]);
      vga->dot(Xloop+7,Yloop, Color[Dot1bit[2]]);

      vga->dot(Xloop+8,Yloop, Color[Dot1bit[1]]);
      vga->dot(Xloop+9,Yloop, Color[Dot1bit[1]]);
      vga->dot(Xloop+10,Yloop, Color[Dot1bit[1]]);
      vga->dot(Xloop+11,Yloop, Color[Dot1bit[1]]);

      vga->dot(Xloop+12,Yloop, Color[Dot1bit[0]]);
      vga->dot(Xloop+13,Yloop, Color[Dot1bit[0]]);
      vga->dot(Xloop+14,Yloop, Color[Dot1bit[0]]);
      vga->dot(Xloop+15,Yloop, Color[Dot1bit[0]]);

