cristianoag/ESP32_CP400/software/esp32_cp400_emulator/src/CP400Emulator.cpp
      vga->dot(Xloop+2,Yloop, Color[Dot1bit[2]]);
      vga->dot(Xloop+3,Yloop, Color[Dot1bit[2]]);

      vga->dot(Xloop+4,Yloop, Color[Dot1bit[1]]);
      vga->dot(Xloop+5,Yloop, Color[Dot1bit[1]]);

      vga->dot(Xloop+6,Yloop, Color[Dot1bit[0]]);
      vga->dot(Xloop+7,Yloop, Color[Dot1bit[0]]);

      Yloop1 = Yloop+1;
      //Line 2

      vga->dot(Xloop,Yloop1, Color[Dot1bit[3]]);
      vga->dot(Xloop+1,Yloop1, Color[Dot1bit[3]]);

      vga->dot(Xloop+2,Yloop1, Color[Dot1bit[2]]);
      vga->dot(Xloop+3,Yloop1, Color[Dot1bit[2]]);

      vga->dot(Xloop+4,Yloop1, Color[Dot1bit[1]]);
      vga->dot(Xloop+5,Yloop1, Color[Dot1bit[1]]);

      vga->dot(Xloop+6,Yloop1, Color[Dot1bit[0]]);
      vga->dot(Xloop+7,Yloop1, Color[Dot1bit[0]]);
      Yloop1++;
      //Line 3

      vga->dot(Xloop,Yloop1, Color[Dot1bit[3]]);
      vga->dot(Xloop+1,Yloop1, Color[Dot1bit[3]]);

      vga->dot(Xloop+2,Yloop1, Color[Dot1bit[2]]);
      vga->dot(Xloop+3,Yloop1, Color[Dot1bit[2]]);

      vga->dot(Xloop+4,Yloop1, Color[Dot1bit[1]]);
      vga->dot(Xloop+5,Yloop1, Color[Dot1bit[1]]);

      vga->dot(Xloop+6,Yloop1, Color[Dot1bit[0]]);
      vga->dot(Xloop+7,Yloop1, Color[Dot1bit[0]]);

      
    }
  }

}


void RenderCP400GraphMode_128X96X2(void)
{
  
  
  if (sf.CP400VideoGenMODE != CP400_GRAPH_MODE_128X96X2)
  {
    vga->clear(0b11111111);
    vga->show();
    vga->clear(0b11111111);
    vga->show();

    sf.CP400VideoGenMODE = CP400_GRAPH_MODE_128X96X2;
  }



  uint32_t MemLoop = sf.CP400VideoPageOffset_Registers * CP400_GRAPH_OFFSET_LEN;
  uint16_t Xloop, Yloop, Yloop1;
  uint8_t Dot1bit[8];
  uint8_t Color[2];

  if ((sf.CP400GraphicMode & 0b00001000) == 0)
  {
    Color[0] = RGB332ToVGAPacked(0b00000000);  //black
    Color[1] = RGB332ToVGAPacked(0b00011100); //green
  }
  else
  {
    Color[0] = RGB332ToVGAPacked(0x00);
    Color[1] = RGB332ToVGAPacked(0xff);
  }  

  for (Yloop = VIDEO_Y_OFFSET; Yloop < VIDEO_Y_OFFSET + VIDEO_ACTIVE_HEIGHT; Yloop+=2)
  {
        for (Xloop = VIDEO_GRAPHICS_X_OFFSET; Xloop < VIDEO_GRAPHICS_X_OFFSET + 256; Xloop+=16)
    {
      Dot1bit[7] = ((memory[MemLoop]>>7) & 0b00000001);
      Dot1bit[6] = ((memory[MemLoop]>>6) & 0b00000001);
      Dot1bit[5] = ((memory[MemLoop]>>5) & 0b00000001);
      Dot1bit[4] = ((memory[MemLoop]>>4) & 0b00000001);
      Dot1bit[3] = ((memory[MemLoop]>>3) & 0b00000001);
      Dot1bit[2] = ((memory[MemLoop]>>2) & 0b00000001);
      Dot1bit[1] = ((memory[MemLoop]>>1) & 0b00000001);
      Dot1bit[0] = (memory[MemLoop++] & 0b00000001);
      
      vga->dot(Xloop,Yloop, Color[Dot1bit[7]]);
      vga->dot(Xloop+1,Yloop, Color[Dot1bit[7]]);

      vga->dot(Xloop+2,Yloop, Color[Dot1bit[6]]);
      vga->dot(Xloop+3,Yloop, Color[Dot1bit[6]]);

      vga->dot(Xloop+4,Yloop, Color[Dot1bit[5]]);
      vga->dot(Xloop+5,Yloop, Color[Dot1bit[5]]);

      vga->dot(Xloop+6,Yloop, Color[Dot1bit[4]]);
      vga->dot(Xloop+7,Yloop, Color[Dot1bit[4]]);

      vga->dot(Xloop+8,Yloop, Color[Dot1bit[3]]);
      vga->dot(Xloop+9,Yloop, Color[Dot1bit[3]]);

      vga->dot(Xloop+10,Yloop, Color[Dot1bit[2]]);
      vga->dot(Xloop+11,Yloop, Color[Dot1bit[2]]);

      vga->dot(Xloop+12,Yloop, Color[Dot1bit[1]]);
      vga->dot(Xloop+13,Yloop, Color[Dot1bit[1]]);

      vga->dot(Xloop+14,Yloop, Color[Dot1bit[0]]);
      vga->dot(Xloop+15,Yloop, Color[Dot1bit[0]]);
      
      //-------------------Second Line----------------------
      Yloop1 = Yloop+1;
      vga->dot(Xloop,Yloop1, Color[Dot1bit[7]]);
      vga->dot(Xloop+1,Yloop1, Color[Dot1bit[7]]);

      vga->dot(Xloop+2,Yloop1, Color[Dot1bit[6]]);
      vga->dot(Xloop+3,Yloop1, Color[Dot1bit[6]]);

      vga->dot(Xloop+4,Yloop1, Color[Dot1bit[5]]);
      vga->dot(Xloop+5,Yloop1, Color[Dot1bit[5]]);

      vga->dot(Xloop+6,Yloop1, Color[Dot1bit[4]]);
      vga->dot(Xloop+7,Yloop1, Color[Dot1bit[4]]);

      vga->dot(Xloop+8,Yloop1, Color[Dot1bit[3]]);
      vga->dot(Xloop+9,Yloop1, Color[Dot1bit[3]]);

      vga->dot(Xloop+10,Yloop1, Color[Dot1bit[2]]);
      vga->dot(Xloop+11,Yloop1, Color[Dot1bit[2]]);

      vga->dot(Xloop+12,Yloop1, Color[Dot1bit[1]]);
      vga->dot(Xloop+13,Yloop1, Color[Dot1bit[1]]);

      vga->dot(Xloop+14,Yloop1, Color[Dot1bit[0]]);
      vga->dot(Xloop+15,Yloop1, Color[Dot1bit[0]]);

    
    
    }
  }




}


void RenderCP400GraphMode_128X96X4(void)
{


  if (sf.CP400VideoGenMODE != CP400_GRAPH_MODE_128X96X4)
  {
    vga->clear(0b11111111);
    vga->show();
    vga->clear(0b11111111);
    vga->show();

    sf.CP400VideoGenMODE = CP400_GRAPH_MODE_128X96X4;
  }




  uint32_t MemLoop = sf.CP400VideoPageOffset_Registers * CP400_GRAPH_OFFSET_LEN;
  uint16_t Xloop, Yloop;
  uint8_t Dot1bit[8];
  uint8_t Color[4];
  
  if ((sf.CP400GraphicMode & 0b00001000) == 0)
  {
    Color[0] = RGB332ToVGAPacked(0b00011100);  //Green
    Color[1] = RGB332ToVGAPacked(0b11111100);  //Yellow
    Color[2] = RGB332ToVGAPacked(0b00000011);  //Blue
    Color[3] = RGB332ToVGAPacked(0b11100000);  //Red
  }
  else
  {
    Color[0] = RGB332ToVGAPacked(0b00000000);  // Black
    Color[2] = RGB332ToVGAPacked(0b11100000);  // Red
    Color[1] = RGB332ToVGAPacked(0b00000011);  // blue
    Color[3] = RGB332ToVGAPacked(0b11111111);  // White
    /*
    Color[0] = RGB332ToVGAPacked(0xff); //blanc
    Color[1] = RGB332ToVGAPacked(0b01011011);  //Turquoise
    Color[2] = RGB332ToVGAPacked(0b11100011);  //lilas
    Color[3] = RGB332ToVGAPacked(0b11101000);  //orange(buff)
    */
  }  

  for (Yloop = VIDEO_Y_OFFSET; Yloop < VIDEO_Y_OFFSET + VIDEO_ACTIVE_HEIGHT; Yloop+=2)
  {
    for (Xloop = VIDEO_GRAPHICS_X_OFFSET; Xloop < VIDEO_GRAPHICS_X_OFFSET + 256; Xloop+=8)
    {

      Dot1bit[3] = (memory[MemLoop] >> 6) & 0b11;  // Bits 6-7
      Dot1bit[2] = (memory[MemLoop] >> 4) & 0b11;  // Bits 4-5
      Dot1bit[1] = (memory[MemLoop] >> 2) & 0b11;  // Bits 2-3
      Dot1bit[0] = (memory[MemLoop++] >> 0) & 0b11;  // Bits 0-1

      //Line one
      vga->dot(Xloop,Yloop, Color[Dot1bit[3]]);
      vga->dot(Xloop+1,Yloop, Color[Dot1bit[3]]);

