cristianoag/ESP32_CP400/software/esp32_cp400_emulator/src/CP400Emulator.cpp
  const uint8_t *diskRom = selectedDiskRom == DiskRomSelection::CP400
                             ? cp400dsk
                             : disk11;

  // Copy the selected disk controller ROM to 0xC000 (8K)
  LoopRam1 = 0xC000;
  for (LoopRomSource = 0; LoopRomSource < 8192; LoopRomSource++)
    memory[LoopRam1++] = diskRom[LoopRomSource];

  // copy memory[0x8000 - 0xFFFF] to rom[0 - 0x7FFF]
  LoopRomSource = 0;
  for (LoopRam1 = 0x8000; LoopRam1 < 0x10000; LoopRam1++)
  {
    rom[LoopRomSource++] = memory[LoopRam1];
  }
  // Reset vectors
  
  uint32_t VectorsLoop = 0;
  LoopRomSource = 0xfff0 - 0x8000;
  for (VectorsLoop = 0; VectorsLoop !=16 ; VectorsLoop++)
  {
    memory[LoopRomSource + 0x8000] = ResetVectors[VectorsLoop];
    rom[LoopRomSource++] = ResetVectors[VectorsLoop];
  }
}


// Loads the active CP400 ROM set (extended BASIC, BASIC, disk controller ROM)
// into emulated memory/ROM space.
void CopyCP400ROMS(void)
{
  uint32_t LoopRomSource, LoopRam1;

  // Copy extbas11 to 0x8000 (8K)
  LoopRam1 = 0x8000;
  for (LoopRomSource = 0; LoopRomSource < 8192; LoopRomSource++)
    memory[LoopRam1++] = extbas11[LoopRomSource];

  // Copy bas12 to 0xA000 (8K)
  LoopRam1 = 0xA000;
  for (LoopRomSource = 0; LoopRomSource < 8192; LoopRomSource++)
  memory[LoopRam1++] = bas13[LoopRomSource];


  const uint8_t *diskRom = selectedDiskRom == DiskRomSelection::CP400
                             ? cp400dsk
                             : disk11;

  // Copy the selected disk controller ROM to 0xC000 (8K)
  LoopRam1 = 0xC000;
  for (LoopRomSource = 0; LoopRomSource < 8192; LoopRomSource++)
    memory[LoopRam1++] = diskRom[LoopRomSource];

  // copy memory[0x8000 - 0xFFFF] to rom[0 - 0x7FFF]
  LoopRomSource = 0;
  for (LoopRam1 = 0x8000; LoopRam1 < 0x10000; LoopRam1++)
  {
    rom[LoopRomSource++] = memory[LoopRam1];
  }
  // Reset vectors
  
  uint32_t VectorsLoop = 0;
  LoopRomSource = 0xfff0 - 0x8000;
  for (VectorsLoop = 0; VectorsLoop !=16 ; VectorsLoop++)
  {
    memory[LoopRomSource + 0x8000] = ResetVectors[VectorsLoop];
    rom[LoopRomSource++] = ResetVectors[VectorsLoop];
  }
}


// Optional CoCo 3 ROM loader, kept for compatibility/reference; not part of
// the active CP400 emulation path (see CopyCP400ROMS()).
void CopyCoCo3ROMS(void)
{
  uint32_t LoopRom1, LoopRam1, LoopRomSource;

  LoopRam1 = 0x8000;  //coco3p
  for (LoopRom1 = 0; LoopRom1 != 8192 * 3; LoopRom1++)
  {
    memory[LoopRam1++] = coco3[LoopRom1];
  }

  const uint8_t *diskRom = selectedDiskRom == DiskRomSelection::CP400
                             ? cp400dsk
                             : disk11;

  LoopRam1 = 0xc000;  // Selected disk controller ROM
  for (LoopRom1 = 0; LoopRom1 != 8192; LoopRom1++)
  {
    memory[LoopRam1++] = diskRom[LoopRom1];
  }

 
    // Copy de memory[0x8000 - 0xFFFF] to rom[0 - 0x7FFF]
    LoopRomSource = 0;
    for (LoopRam1 = 0x8000; LoopRam1 < 0x10000; LoopRam1++)
    {
      rom[LoopRomSource++] = memory[LoopRam1];
    }

    
 
  return;
}

/*
DRQ = 1 when the Computer can read data or write data to the register.
DRQ is 0 when is busy.
*/

#define MACRO_TRACK_R DiskAccess.DSK_FILE_DataPTR = (DiskAccess.TrackPos * 18 * 256) + ((DiskAccess.SectorPos - 1) * 256)
#define MACRO_TRACK_W DiskAccess.DSK_FILE_DataPTR = (DiskAccess.TrackPos * 18 * 256) + ((DiskAccess.SectorPos - 1) * 256)
#define M_DRQ_BIT_READY 0b00000010
  
  
  
void ManagePeripherals_Read(uint16_t address)
{
  
  
  if (DiskAccess.NMI_Delay >0)
  {
    DiskAccess.NMI_Delay--;
    if (DiskAccess.NMI_Delay==2)
    {
      sf.nmi_pin = false;  //NMI Started
    }

    if (DiskAccess.NMI_Delay == 1)
    {
      sf.nmi_pin = true;  //NMI Stopped

    }


  }


  //Manage all the read operation of memory addresses
  switch (address)
  {
    case M_FF02: //ROM_FF02:
      rom[ROM_FF03] &= 0b01111111;  //If ff02 Address is read, it reset the Vsynch interrupt flag AT ff03.
      if (sf.V_Synch_Int_Enabled)
      {
        sf.irq_pin = true;  //Interrupt Disabled.
      }
      sf.V_Synch = false; 

      break;
      //All next are drive related--------------------------

      
    case M_FF00: //ROM_FF02:

    uint8_t val1, buttons, tmp1;
    uint8_t MultiplexerCB2_CA2;
    if (true)  
    {
      ManageKeyboardScan(rom[ROM_FF02]);
      //Do the joystick stuff first
      buttons = ReadCP400Buttons();
      
      if ((buttons & 0b00000001) == 0)
      {
        //Serial.print("JO");
        sf.is_JOY1_B1_WasPressed=true;
        rom[ROM_FF00] &=0b11111110;
      }
      else
      {

        if (!sf.is_LastKeyboardScanned)
        {
          rom[ROM_FF00] |=0b00000001;
        }
        else
        {
          sf.is_LastKeyboardScanned = false;
        }
      }

      if ((buttons & 0b00000010) == 0)
      {
        
        rom[ROM_FF00] &=0b11111101;
      }
      
      
    
      MultiplexerCB2_CA2 = (((rom[ROM_FF03] & 0b00001000)>>2) | ((rom[ROM_FF01] & 0b00001000)>>3));   //Get the two bits Comparator Selection
      val1 = ReadJoysticks(MultiplexerCB2_CA2);   //Sample Requested joystick
      
      if (val1 > (rom[ROM_FF20] & 0b11111100))
      {
        rom[ROM_FF00] |= 0b10000000;

      }
      else
      {
        rom[ROM_FF00] &= 0b01111111;

      }

    }
    else //Manage Keyboard
    {
      uint8_t val1;
      ManageKeyboardScan(rom[ROM_FF02]);
    }

    

      break;


    case M_FF48: 

      if (DiskAccess.IsinReadProcess)   //If Disk Access transaction;
      {
        rom[ROM_FF48] = M_DRQ_BIT_READY;  //Will step the ASM routine to read the next Byte
      }
      else
      {
        rom[ROM_FF48] = M_DRQ_BIT_READY;  //Always no error
      }

    break;    //error here, this is why the next block works
    case  M_FF4B:
      
    if (DiskAccess.IsinReadProcess)
    {
      
      DiskAccess.DriveSelected = GetDriveNumber(rom[ROM_FF40]);
      if (DiskAccess.DriveSelected != Disk_Drive.LastNumber_Accessed)
      {
        Disk_Drive.LastNumber_Accessed = DiskAccess.DriveSelected;
        if (Disk_Drive.isFileAlreadyOpen)
        {
          //file.close(); //Close the actual
        }


        Disk_Drive.isFileAlreadyOpen = true;
      }
      rom[ROM_FF4B] = ReadDiskByte(DiskAccess.DSK_FILE_DataPTR);  //RAM_Disk[DiskAccess.DSK_FILE_DataPTR++];
      DiskAccess.DSK_FILE_DataPTR++;
      DiskAccess.RW_Process_ByteRemainingCounter--;
      if (DiskAccess.RW_Process_ByteRemainingCounter==0)
      {
        rom[ROM_FF48] = 0;
        DiskAccess.IsinReadProcess = false;
        DISKETTE_LED_OFF();
        DiskAccess.NMI_Delay = 4;
        sf.nmi_pin = false;  //NMI Started
        
