cristianoag/ESP32_CP400/software/esp32_cp400_emulator/src/CP400Emulator.cpp
}
  
  
  void ManageKeyboardScan(uint8_t value)
  {
    uint8_t loop1, loop2, Val1;
    bool ValDone = false;

    Val1 = value ^ 0b11111111;
    rom[ROM_FF00] |= 0b01111111;   //Reset to nothing to scan.
    
    if (ReadCP400Buttons()==3 && !sf.is_JOY1_B1_WasPressed) //All buttons released and was not pressed
    {
      sf.is_LastKeyboardScanned = true;
      
      if ((Val1 & 0b10000000) != 0 && ValDone == false) //case 0b01111111
      {
        for (loop1 = 0; loop1 !=7; loop1++)  //Scan the collumn for active keypress
        {
          if (SCAN_Keyboard_Matrix[7][loop1] != 0)
          {

            rom[ROM_FF00] &= SCAN_Keyboard_Matrix[7][loop1];
            ValDone = true;
          }
        }
      }

      if ((Val1 & 0b01000000) != 0 && ValDone == false) //case 0b10111111
      {
        for (loop1 = 0; loop1 !=7; loop1++)  //Scan the collumn for active keypress
        {
          if (SCAN_Keyboard_Matrix[6][loop1] != 0)
          {
            rom[ROM_FF00] &= SCAN_Keyboard_Matrix[6][loop1];
            ValDone = true;
          }
        }
      }

      if ((Val1 & 0b00100000) != 0 && ValDone == false) //case 0b11011111
      {
        for (loop1 = 0; loop1 !=7; loop1++)  //Scan the collumn for active keypress
        {
          if (SCAN_Keyboard_Matrix[5][loop1] != 0)
          {
            rom[ROM_FF00] &= SCAN_Keyboard_Matrix[5][loop1];
            ValDone = true;
          }
        }
      }
        
      if ((Val1 & 0b00010000) != 0 && ValDone == false) //case 0b11101111
      {
        for (loop1 = 0; loop1 !=7; loop1++)  //Scan the collumn for active keypress
        {
          if (SCAN_Keyboard_Matrix[4][loop1] != 0)
          {
            rom[ROM_FF00] &= SCAN_Keyboard_Matrix[4][loop1];
            ValDone = true;
          }
        }
      }

      if ((Val1 & 0b00001000) != 0 && ValDone == false) //case 0b11110111
      {
        for (loop1 = 0; loop1 !=7; loop1++)  //Scan the collumn for active keypress
        {
          if (SCAN_Keyboard_Matrix[3][loop1] != 0)
          {
            rom[ROM_FF00] &= SCAN_Keyboard_Matrix[3][loop1];
            ValDone = true;
          }
        }
      } 
      
      if ((Val1 & 0b00000100) != 0 && ValDone == false) //case 0b11111011
      {
        for (loop1 = 0; loop1 !=7; loop1++)  //Scan the collumn for active keypress
        {
          if (SCAN_Keyboard_Matrix[2][loop1] != 0)
          {
            rom[ROM_FF00] &= SCAN_Keyboard_Matrix[2][loop1];
            ValDone = true;
          }
        }
      }

      if ((Val1 & 0b00000010) != 0 && ValDone == false) //case 0b11111101
      {
        for (loop1 = 0; loop1 !=7; loop1++)  //Scan the collumn for active keypress
        {
          if (SCAN_Keyboard_Matrix[1][loop1] != 0)
          {
            rom[ROM_FF00] &= SCAN_Keyboard_Matrix[1][loop1];
            ValDone = true;
          }
        }
      }
        
      if ((Val1 & 0b00000001) != 0 && ValDone == false) //case 0b11111110
      {
        for (loop1 = 0; loop1 !=7; loop1++)  //Scan the collumn for active keypress
        {
          if (SCAN_Keyboard_Matrix[0][loop1] != 0)
          {
            rom[ROM_FF00] &= SCAN_Keyboard_Matrix[0][loop1];
            ValDone = true;
          }
        }
      }

      
    }
    else
    {

      sf.is_JOY1_B1_WasPressed=false;
      rom[ROM_FF00] &= 0x7f;
    }
  }


  //--------------------------------VDG MAP----------------------------------------------------------
  


  void DisplayVDGchar(uint8_t charNum, uint16_t Xpos, uint16_t Ypos)
  {
    uint32_t loop1;
    uint16_t XposLoop, YposLoop;
    uint8_t convertedLine[8];
    loop1 = charNum * 8 * 12;
    for (YposLoop = Ypos; YposLoop != Ypos+12; YposLoop++)
    {
      for (uint8_t pixel = 0; pixel < sizeof(convertedLine); pixel++)
      {
        convertedLine[pixel] = RGB332ToVGAPacked(cc2_VDG_MAP[loop1 + pixel]);
      }
      vga->drawLineFromMemory8(Xpos, YposLoop, convertedLine);
      loop1+=8;
    }
  }

void line(int x0, int y0, int x1, int y1, int rgb)
{
    int dx = abs(x1 - x0);
    int sx = x0 < x1 ? 1 : -1;

    int dy = -abs(y1 - y0);
    int sy = y0 < y1 ? 1 : -1;

    int err = dx + dy; 

    while (true)
    {
        vga->dot(x0, y0, rgb); 

        if (x0 == x1 && y0 == y1)
            break;

        int e2 = 2 * err;
        if (e2 >= dy)
        {
            err += dy;
            x0 += sx;
        }
        if (e2 <= dx)
        {
            err += dx;
            y0 += sy;
        }
    }
}


  //---------------------------------------USB STACK FOR CP400 KEYBOARD MAPPING AND JOYSTICKS-----------------------




static void my_USB_DetectCB( uint8_t usbNum, void * dev )
{
  sDevDesc *device = (sDevDesc*)dev;
  printf("USB device detected on port %u: VID=0x%04x PID=0x%04x\n",
         usbNum, device->idVendor, device->idProduct);
#ifdef DEBUG_PRINT  
  printf("New device detected on USB#%d\n", usbNum);
  printf("desc.bcdUSB             = 0x%04x\n", device->bcdUSB);
  printf("desc.bDeviceClass       = 0x%02x\n", device->bDeviceClass);
  printf("desc.bDeviceSubClass    = 0x%02x\n", device->bDeviceSubClass);
  printf("desc.bDeviceProtocol    = 0x%02x\n", device->bDeviceProtocol);
  printf("desc.bMaxPacketSize0    = 0x%02x\n", device->bMaxPacketSize0);
  printf("desc.idVendor           = 0x%04x\n", device->idVendor);
  printf("desc.idProduct          = 0x%04x\n", device->idProduct);
  printf("desc.bcdDevice          = 0x%04x\n", device->bcdDevice);
  printf("desc.iManufacturer      = 0x%02x\n", device->iManufacturer);
  printf("desc.iProduct           = 0x%02x\n", device->iProduct);
  printf("desc.iSerialNumber      = 0x%02x\n", device->iSerialNumber);
  printf("desc.bNumConfigurations = 0x%02x\n", device->bNumConfigurations);
#endif
  // if( device->iProduct == mySupportedIdProduct && device->iManufacturer == mySupportedManufacturer ) {
  //   myListenUSBPort = usbNum;
  // }
}


static void my_USB_PrintCB(uint8_t usbNum, uint8_t byte_depth, uint8_t* data, uint8_t data_len)
{
  // if( myListenUSBPort != usbNum ) return;
  if (usbNum == USB_DEV_CONTROL.PORT_KEYBOARD)
  {
    UpdateKeyMap(data);
  }
  else if (usbNum == USB_DEV_CONTROL.PORT_JOY1)
  {
    UpdateJoyMap(data, data_len, usbNum);
  }
  else if (usbNum == USB_DEV_CONTROL.PORT_JOY2)
  {
    UpdateJoyMap(data, data_len, usbNum);
  }
  
