cristianoag/ESP32_CP400/software/esp32_cp400_emulator/src/CP400Emulator.cpp
            //-------------------------------------------
        
        default:
            break;
        }
        if (ShiftDisabled == true)
        {
            USB_DEV_CONTROL.USB_CP400_Key_Array[7] &= lookupAND_6;
        }
        if (ForceShift == true)
        {
            USB_DEV_CONTROL.USB_CP400_Key_Array[7] |= lookupOR_6;
        }
    }

}

void PrintJoystickState(uint8_t joystick)
{
  const uint8_t reportLength = USB_DEV_CONTROL.JOYSTICK_REPORT_LENGTH[joystick];
  const uint8_t *report = USB_DEV_CONTROL.JOYSTICK_REPORT[joystick];

  printf("JOY%u raw[%u]:", joystick + 1, reportLength);
  for (uint8_t index = 0; index < reportLength; index++)
  {
    printf(" %02X", report[index]);
  }

  if (USB_DEV_CONTROL.JOYSTICK_CALIBRATION[joystick].valid)
  {
    printf("  U%u D%u L%u R%u B1:%u B2:%u",
           IsJoystickControlActive(joystick, JOYSTICK_UP) ? 1 : 0,
           IsJoystickControlActive(joystick, JOYSTICK_DOWN) ? 1 : 0,
           IsJoystickControlActive(joystick, JOYSTICK_LEFT) ? 1 : 0,
           IsJoystickControlActive(joystick, JOYSTICK_RIGHT) ? 1 : 0,
           IsJoystickControlActive(joystick, JOYSTICK_BUTTON_1) ? 1 : 0,
           IsJoystickControlActive(joystick, JOYSTICK_BUTTON_2) ? 1 : 0);
  }
  else
  {
    printf("  [uncalibrated]");
  }

  printf("  J1 X=%u Y=%u F=%u%u  J2 X=%u Y=%u F=%u%u\n",
         USB_DEV_CONTROL.JOY1_X_AXIS, USB_DEV_CONTROL.JOY1_Y_AXIS,
         USB_DEV_CONTROL.JOY1_BUTT1, USB_DEV_CONTROL.JOY1_BUTT2,
         USB_DEV_CONTROL.JOY2_X_AXIS, USB_DEV_CONTROL.JOY2_Y_AXIS,
         USB_DEV_CONTROL.JOY2_BUTT1, USB_DEV_CONTROL.JOY2_BUTT2);
}

void UpdateJoyMap(uint8_t * Data, uint8_t dataLength, uint8_t usbNum)
{
  if (usbNum != USB_DEV_CONTROL.PORT_JOY1 && usbNum != USB_DEV_CONTROL.PORT_JOY2)
  {
    return;
  }

  const uint8_t joystick = usbNum == USB_DEV_CONTROL.PORT_JOY1 ? 0 : 1;
  const uint8_t reportLength = min(dataLength, static_cast<uint8_t>(JOYSTICK_REPORT_SIZE));

  memcpy(USB_DEV_CONTROL.JOYSTICK_REPORT[joystick], Data, reportLength);
  memset(USB_DEV_CONTROL.JOYSTICK_REPORT[joystick] + reportLength, 0,
         JOYSTICK_REPORT_SIZE - reportLength);
  USB_DEV_CONTROL.JOYSTICK_REPORT_LENGTH[joystick] = reportLength;

  uint8_t xAxis;
  uint8_t yAxis;
  uint8_t button1;
  uint8_t button2;

  if (USB_DEV_CONTROL.JOYSTICK_CALIBRATION[joystick].valid)
  {
    const bool up = IsJoystickControlActive(joystick, JOYSTICK_UP);
    const bool down = IsJoystickControlActive(joystick, JOYSTICK_DOWN);
    const bool left = IsJoystickControlActive(joystick, JOYSTICK_LEFT);
    const bool right = IsJoystickControlActive(joystick, JOYSTICK_RIGHT);
    xAxis = (left == right) ? 128 : (left ? 0 : 255);
    yAxis = (up == down) ? 128 : (up ? 0 : 255);
    button1 = IsJoystickControlActive(joystick, JOYSTICK_BUTTON_1) ? 0 : 1;
    button2 = IsJoystickControlActive(joystick, JOYSTICK_BUTTON_2) ? 0 : 1;
  }
  else if (dataLength >= 2)
  {
    const uint8_t buttonBits = dataLength > 4 ? Data[4] : 0;
    xAxis = Data[0];
    yAxis = Data[1];
    button1 = (buttonBits & 0x10) ? 0 : 1;
    button2 = (buttonBits & 0x20) ? 0 : 1;
  }
  else
  {
    return;
  }

  if (joystick == 0)
  {
    USB_DEV_CONTROL.JOY1_X_AXIS = xAxis;
    USB_DEV_CONTROL.JOY1_Y_AXIS = yAxis;
    USB_DEV_CONTROL.JOY1_BUTT1 = button1;
    USB_DEV_CONTROL.JOY1_BUTT2 = button2;
  }
  else
  {
    USB_DEV_CONTROL.JOY2_X_AXIS = xAxis;
    USB_DEV_CONTROL.JOY2_Y_AXIS = yAxis;
    USB_DEV_CONTROL.JOY2_BUTT1 = button1;
    USB_DEV_CONTROL.JOY2_BUTT2 = button2;
  }

  //One pad drives both CP400 axis pairs, since games differ on which joystick they read.
  if (USB_DEV_CONTROL.JOYSTICK_REPORT_LENGTH[joystick ^ 1] == 0)
  {
    if (joystick == 0)
    {
      USB_DEV_CONTROL.JOY2_X_AXIS = xAxis;
      USB_DEV_CONTROL.JOY2_Y_AXIS = yAxis;
    }
    else
    {
      USB_DEV_CONTROL.JOY1_X_AXIS = xAxis;
      USB_DEV_CONTROL.JOY1_Y_AXIS = yAxis;
    }
  }
}

//-----------------End USB CP400 MAP--------------------------------------------
